cfg/Documents/Опрос.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Опрос</Name>
			<BasedOn>
				<xr:Item>Catalog.ТиповыеАнкеты</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОпрашиваемоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповаяАнкета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеАнкеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РассылкаАнкет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТиповойОтвет</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВопросыДляАнкетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СекундОтвета</Name>
							<Comment>Количество затраченных секунд на ответ</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставнойОтвет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВопросВладелец</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТиповойОтвет</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВопросыДляАнкетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиВТаблице</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfg/Enums/ТипВопросаАнкеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипВопросаАнкеты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СправочникСсылка_ВариантыОтветов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СправочникСсылка_ВариантыОтветов_Несколько</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табличный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Catalogs/ТиповыеАнкеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ТиповыеАнкеты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗагружатьОбъекты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МакетАнкеты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСправочникаДляЗагрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовЗагружаемыхИзОпроса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адресная</Name>
					<Comment>Установка данного флажка говорит о том, что анкета будет предназначена конкретным людям</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеАнкеты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вступление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВопросыАнкеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыАнкеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ОбязательностьЗаполненияОтветаНаВопрос</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВопросУсловия</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеОтвета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветУсловия</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВопросыДляАнкетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЗначенийУсловия</Name>
					<Comment>Список значений, используемых в условии обязательности овтета на вопрос</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВопросВладелец</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСписка</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВопросыДляАнкетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/ChartsOfCharacteristicTypes/ВопросыДляАнкетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ВопросыДляАнкетирования</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ЯзыкиНародовМира</v8:Type>
				<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
				<v8:Type>cfg:EnumRef.ОтношениеКВоинскомуУчету</v8:Type>
				<v8:Type>cfg:CatalogRef.СтепениЗнанияЯзыка</v8:Type>
				<v8:Type>cfg:EnumRef.ГодностьКВоеннойСлужбе</v8:Type>
				<v8:Type>cfg:EnumRef.ПрофилиОфицеров</v8:Type>
				<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
				<v8:Type>cfg:EnumRef.ФормыОбучения</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ВоинскиеЗвания</v8:Type>
				<v8:Type>cfg:CatalogRef.СтепениРодстваФизЛиц</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыОбразованияФизЛиц</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
				<v8:Type>cfg:CatalogRef.ВариантыОтветовОпросов</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
				<v8:Type>cfg:EnumRef.КатегорииВоинскогоУчета</v8:Type>
				<v8:Type>cfg:CatalogRef.Военкоматы</v8:Type>
				<v8:Type>cfg:CatalogRef.СемейноеПоложениеФизЛиц</v8:Type>
				<v8:Type>cfg:EnumRef.ОтношениеКВоинскойОбязанности</v8:Type>
				<v8:Type>cfg:EnumRef.ГруппыВоинскогоУчета</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>200</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолнаяФормулировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесВопроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязателенДляЗаполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСтрокТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВопроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипВопросаАнкеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВидКонтакнойИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СекундОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КолонкиТаблицы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КолонкаТаблицы</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

cfg/Documents/Опрос/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мСтараяТиповаяАнкета; // хранит старое значение элемент "Типовая анкета"
Перем мТекущаяДатаДокумента; // Хранит последнюю установленную дату документа - для проверки перехода документа в другой период
Перем ТаблицаВопросовОтветовПоАнкете;

// Хранит дерево кнопок подменю заполнение ТЧ
Перем мКнопкиЗаполненияТЧ;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура устанавливает подменю "Заполнить" в командных панелях ТЧ документа при необходимости
//
Процедура УстановитьКнопкиПодменюЗаполненияТЧ();
	
	мКнопкиЗаполненияТЧ = УниверсальныеМеханизмы.ПолучитьДеревоКнопокЗаполненияТабличныхЧастей(Ссылка,Новый Действие("НажатиеНаДополнительнуюКнопкуЗаполненияТЧ"));
	
	СоответствиеТЧ = Новый Соответствие;
	СоответствиеТЧ.Вставить(ЭлементыФормы.ВопросыИОтветы,ЭлементыФормы.КоманднаяПанельВопросыИОтветы);
	
	УниверсальныеМеханизмы.СформироватьПодменюЗаполненияТЧПоДеревуКнопок(мКнопкиЗаполненияТЧ,СоответствиеТЧ);
	
КонецПроцедуры

// Процедура - обработчик нажатия на любую из дополнительных кнопок по заполнению ТЧ
//
Процедура НажатиеНаДополнительнуюКнопкуЗаполненияТЧ(Кнопка)
	
	УниверсальныеМеханизмы.ОбработатьНажатиеНаДополнительнуюКнопкуЗаполненияТЧ(мКнопкиЗаполненияТЧ.Строки.Найти(Кнопка.Имя,"Имя",Истина),ЭтотОбъект);
	
КонецПроцедуры


// Управление колонкой "Ответ". В  зависимости от вопроса, поведение колонки "Ответ"
//  будет разным.
//
// Параметры
//  ВыбраннаяСтрока  – Строка табличной части – строка, в которой необходимо ответить 
//                 на вопрос.
//  Отказ		  – Булево – отказ от ввода непосредственно в строке.
//
Процедура ПодоготовитьПолучениеОтвета(ВыбраннаяСтрока, Отказ)
	
	ВопросыКонтактнаяИнформация = Новый СписокЗначений();
	ВопросыКонтактнаяИнформация.Добавить(Перечисления.ТипВопросаАнкеты.Адрес);
	ВопросыКонтактнаяИнформация.Добавить(Перечисления.ТипВопросаАнкеты.АдресЭлектроннойПочты);
	ВопросыКонтактнаяИнформация.Добавить(Перечисления.ТипВопросаАнкеты.ВебСтраница);
	ВопросыКонтактнаяИнформация.Добавить(Перечисления.ТипВопросаАнкеты.Другое);
	//ВопросыКонтактнаяИнформация.Добавить(Перечисления.ТипВопросаАнкеты.МестныйТелефон);
	//ВопросыКонтактнаяИнформация.Добавить(Перечисления.ТипВопросаАнкеты.ПроизвольныйАдрес);
	ВопросыКонтактнаяИнформация.Добавить(Перечисления.ТипВопросаАнкеты.Телефон);
	
	ТипВопроса = ВыбраннаяСтрока.Вопрос.ТипЗначения;
	Если ВопросыКонтактнаяИнформация.НайтиПоЗначению(ВыбраннаяСтрока.Вопрос.ТипВопроса) <> Неопределено Тогда
		
		ФормаРедактированияОтвета = ПолучитьФорму("ФормаВводаОтветовТеста");
		ФормаРедактированияОтвета.Вопрос = ВыбраннаяСтрока.Вопрос;
		ФормаРедактированияОтвета.ОткрытьМодально();
		Отказ = Истина; 
		
		//Если ВыбраннаяСтрока.Вопрос.ТипВидКонтакнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		//	
		//	ФормаРедактированияОтвета = ПолучитьФорму("ФормаВводаОтветаАдрес");
		//	ФормаРедактированияОтвета.ТиповойОтвет = ВыбраннаяСтрока.ТиповойОтвет;
		//	ФормаРедактированияОтвета.ОткрытьМодально();
		//	ВыбраннаяСтрока.ТиповойОтвет = ФормаРедактированияОтвета.ТиповойОтвет;
		//	Отказ = Истина;
		//	
		//ИначеЕсли ВыбраннаяСтрока.Вопрос.ТипВидКонтакнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		//	
		//	ФормаРедактированияОтвета = ПолучитьФорму("ФормаВводаОтветаТелефон");
		//	ФормаРедактированияОтвета.ТиповойОтвет = ВыбраннаяСтрока.ТиповойОтвет;
		//	ФормаРедактированияОтвета.ОткрытьМодально();
		//	ВыбраннаяСтрока.ТиповойОтвет = ФормаРедактированияОтвета.ТиповойОтвет;
		//	Отказ = Истина;
		//	
		//Иначе
		//	
		//	ЭлементыФормы.ВопросыИОтветы.ТекущаяКолонка.ЭлементУправления.КнопкаВыбора  = Ложь;
		//	ЭлементыФормы.ВопросыИОтветы.ТекущаяКолонка.ЭлементУправления.КнопкаОчистки = Ложь;
		//	
		//КонецЕсли;
		
	ИначеЕсли ТипВопроса.СодержитТип(Тип("Булево")) Тогда
		
		Отказ = Истина;  
		
		ПредыдущееЗначение = ВыбраннаяСтрока.ТиповойОтвет;
		Если ТипЗнч(ПредыдущееЗначение) <> Тип("Булево") Тогда
			ПредыдущееЗначение = Ложь;
		КонецЕсли;
		ВыбраннаяСтрока.ТиповойОтвет = НЕ ПредыдущееЗначение;
		
	ИначеЕсли ТипВопроса.СодержитТип(Тип("Строка")) Тогда
		Если ВыбраннаяСтрока.Вопрос.ТипВопроса = Перечисления.ТипВопросаАнкеты.Текст тогда
			ФормаРедактированияОтвета = ПолучитьФорму("ФормаВводаОтветаТекст");
			ФормаРедактированияОтвета.ТиповойОтвет        = ВыбраннаяСтрока.ТиповойОтвет;
			ФормаРедактированияОтвета.ОткрытьМодально();
			ВыбраннаяСтрока.ТиповойОтвет = ФормаРедактированияОтвета.ТиповойОтвет;
			Отказ = Истина;
		Иначе
			ЭлементыФормы.ВопросыИОтветы.ТекущаяКолонка.ЭлементУправления.КнопкаВыбора  = Ложь;
			ЭлементыФормы.ВопросыИОтветы.ТекущаяКолонка.ЭлементУправления.КнопкаОчистки = Ложь;
		КонецЕсли;
	ИначеЕсли ТипВопроса.СодержитТип(Тип("Число")) или ТипВопроса.СодержитТип(Тип("Дата")) Тогда
		
		ЭлементыФормы.ВопросыИОтветы.ТекущаяКолонка.ЭлементУправления.КнопкаВыбора  = Истина;
		ЭлементыФормы.ВопросыИОтветы.ТекущаяКолонка.ЭлементУправления.КнопкаОчистки = Ложь;
		
	ИначеЕсли ТипВопроса.СодержитТип(Тип("СправочникСсылка.ВариантыОтветовОпросов")) Тогда
		
		ФормаРедактированияОтвета = ПолучитьФорму("ФормаВводаОтветовТеста");
		ФормаРедактированияОтвета.Вопрос = ВыбраннаяСтрока.Вопрос;
		ФормаРедактированияОтвета.ОткрытьМодально();
		Отказ = Истина; Возврат;
		
	Иначе
		
		ЭлементыФормы.ВопросыИОтветы.ТекущаяКолонка.ЭлементУправления.КнопкаВыбора  = Истина;
		ЭлементыФормы.ВопросыИОтветы.ТекущаяКолонка.ЭлементУправления.КнопкаОчистки = Истина;
		
	КонецЕсли;                                     
	
КонецПроцедуры

// Функция проверяет пустая строка или нет.
//
// Параметры
//  ВыбСтрока	 – Строка – проверяемая строка.
//                 
//  ПризнакЗапятой  – Булево  
//
// Возвращаемое значение:
//   Строка   – пустая строка.
//
Функция ПроверкаПустойСтроки(ВыбСтрока, ПризнакЗапятой = Истина)
	
	Если ПустаяСтрока(ВыбСтрока) Тогда
		Возврат "";
	Иначе
		Возврат ?(ПризнакЗапятой,",","")+" ";
	КонецЕсли; 
	
КонецФункции // ПроверкаПустойСтроки()

// Функция подготавливает таблицу с вопросами и возможными ответами к ней.
//
// Параметры
//  Анкета  – СправочникСсылка.ТиповыеАнкеты – анкета, по которой собираются
//                  данные.
//
// Возвращаемое значение:
//   ТаблицаЗначений   – таблица с вопросами и возможными ответами.
//
Функция ЗапросПоАнкете(Анкета)
	
	ЗапросКАнкете = Новый Запрос();
	ЗапросКАнкете.УстановитьПараметр("Анкета", Анкета);
	
    ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТиповыеАнкетыВопросыАнкеты.Вопрос,
	|	ВариантыОтветовОпросов.ТребуетРазвернутыйОтвет,
	|	ВариантыОтветовОпросов.Ссылка КАК Ответ
	|ИЗ
	|	Справочник.ТиповыеАнкеты.ВопросыАнкеты КАК ТиповыеАнкетыВопросыАнкеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыОтветовОпросов КАК ВариантыОтветовОпросов
	|		ПО ТиповыеАнкетыВопросыАнкеты.Вопрос = ВариантыОтветовОпросов.Владелец
	|
	|ГДЕ
	|	ТиповыеАнкетыВопросыАнкеты.Ссылка = &Анкета";
	
	ЗапросКАнкете.Текст = ТекстЗапроса;

	ТаблицаВопросовОтветовПоАнкете = Новый ТаблицаЗначений;
	ТаблицаВопросовОтветовПоАнкете = ЗапросКАнкете.Выполнить().Выгрузить();
	
	Возврат  ТаблицаВопросовОтветовПоАнкете;
	
КонецФункции // ЗапросПоАнкете()

// Процедура сворачивает панель с таблицами вопросов и ответов
// в случае если текущей пользователь является опрашиваемым лицом
// для возможности ответа на вопросы теста по очереди
Процедура ПроверкаДоступностиТаблицВопросовИОтветов()
	
	Если ЗначениеЗаполнено(ОпрашиваемоеЛицо) И ОпрашиваемоеЛицо = глЗначениеПеременной("глТекущийПользователь").ФизЛицо Тогда
		ЭлементыФормы.ПанельОтветов.Свертка           = РежимСверткиЭлементаУправления.Верх;
		ЭлементыФормы.ОпрашиваемоеЛицо.ТолькоПросмотр = Истина;
	Иначе
		ЭлементыФормы.ПанельОтветов.Свертка = РежимСверткиЭлементаУправления.Нет;
	КонецЕсли;
	
КонецПроцедуры

Процедура АктуализироватьТЧСоставногоОтвета(Элемент, Отказ)
	
	ТекСтрока = ЭлементыФормы.ВопросыИОтветы.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено тогда
		ТекущийТабличныйВопрос 	= ТекСтрока.Вопрос;
		Если Элемент.ТекущаяСтрока <> Неопределено тогда
			Если ТекущийТабличныйВопрос.ТипВопроса = Перечисления.ТипВопросаАнкеты.Табличный тогда
				НомерСтроки				= Элемент.ТекущаяСтрока.НомерСтроки;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ТаблицаСоставногоОтвета.Количество() = 0 тогда
		
		СтруктураПоиска = Новый Структура("ВопросВладелец");
		СтруктураПоиска.Вставить("ВопросВладелец", 		ТекущийТабличныйВопрос); 
		
		СтрокиКУдалению = СоставнойОтвет.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаДляУдаления из СтрокиКУдалению Цикл
			СоставнойОтвет.Удалить(СтрокаДляУдаления);
		КонецЦикла;
		
	Иначе
		
		// здесь при редактировании составного ответа удаляем все строки соответствуюшие вопросу владельцу
		// и заново их добавляем
		// для табличного вопроса удаляем все ответы соответствующие данной строке таблицы и заново их добавляем
		// связано с тем, что у табличного вопроса строки фиксированы, а у составного их может быть в общем случае
		// столько, сколько у него вариантов ответа
		
		Если ТекущийТабличныйВопрос.ТипВопроса = Перечисления.ТипВопросаАнкеты.Табличный тогда
			СтруктураПоиска = Новый Структура("НомерСтрокиВТаблице,ВопросВладелец");
			//для табличного вопроса будем искать еще и по номеру строки (это ноер строки в таблице табличного вопроса)
			СтруктураПоиска.Вставить("НомерСтрокиВТаблице", НомерСтроки); 
		Иначе
			СтруктураПоиска = Новый Структура("ВопросВладелец");
		КонецЕсли;
		СтруктураПоиска.Вставить("ВопросВладелец", 		ТекущийТабличныйВопрос); 
		
		СтрокиКУдалению = СоставнойОтвет.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаДляУдаления из СтрокиКУдалению Цикл
			СоставнойОтвет.Удалить(СтрокаДляУдаления);
		КонецЦикла;
		
		СтрокаСоставногоВопроса 				= Элемент.ТекущаяСтрока;
		Если ТекущийТабличныйВопрос.ТипВопроса 	= Перечисления.ТипВопросаАнкеты.СправочникСсылка_ВариантыОтветов_Несколько тогда
			Для каждого СтрокаОтвета из ТаблицаСоставногоОтвета Цикл
				НоваяСтрокаОтвета 						= СоставнойОтвет.Добавить();
				НоваяСтрокаОтвета.Вопрос 				= ТекущийТабличныйВопрос;
				НоваяСтрокаОтвета.ВопросВладелец		= ТекущийТабличныйВопрос;
				НоваяСтрокаОтвета.НомерСтрокиВТаблице 	= СтрокаОтвета.НомерСтроки;
				НоваяСтрокаОтвета.ТиповойОтвет 			= СтрокаОтвета.ВариантОтвета;
				НоваяСтрокаОтвета.Ответ		 			= СтрокаОтвета.Ответ;
			КонецЦикла;
		Иначе
			КолонкиСоставногоОтвета = ТекСтрока.Вопрос.КолонкиТаблицы;
			//СтрокаСоставногоВопроса = Элемент.ТекущаяСтрока;
			
			Для каждого КолонкаОтвета из КолонкиСоставногоОтвета Цикл
				НоваяСтрокаОтвета 						= СоставнойОтвет.Добавить();
				НоваяСтрокаОтвета.Вопрос 				= КолонкаОтвета.КолонкаТаблицы;
				НоваяСтрокаОтвета.ВопросВладелец		= ТекущийТабличныйВопрос;
				НоваяСтрокаОтвета.НомерСтрокиВТаблице 	= НомерСтроки;
				НоваяСтрокаОтвета.ТиповойОтвет 			= СтрокаСоставногоВопроса["колонка"+КолонкаОтвета.НомерСтроки];
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСписокВопросов()
	
	Если ЭтоНовый() или Модифицированность() Тогда
		Вопрос = НСтр("ru='Необходимо записать документ. Записать?';uk='Необхідно записати документ. Записати?'");
		Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ОКОтмена);
		Если Ответ = КодВозвратаДиалога.ОК Тогда
			ЗаписатьВФорме();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВопросыАнкеты.НомерСтроки КАК НомерСтроки,
	|	ВопросыАнкеты.Вопрос КАК Вопрос,
	|	ОпросВопросы.Ответ,
	|	ОпросВопросы.ТиповойОтвет,
	|	NULL КАК НомерСтрокиВТаблице,
	|	NULL КАК КолонкаТаблицы,
	|	ВопросыАнкеты.ТипВопроса КАК ТипВопроса,
	|	NULL КАК НомерСтрокиКолонки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТиповыеАнкетыВопросыАнкеты.Вопрос КАК Вопрос,
	|		ТиповыеАнкетыВопросыАнкеты.НомерСтроки КАК НомерСтроки,
	|		ТиповыеАнкетыВопросыАнкеты.Вопрос.ТипВопроса КАК ТипВопроса
	|	ИЗ
	|		Справочник.ТиповыеАнкеты.ВопросыАнкеты КАК ТиповыеАнкетыВопросыАнкеты
	|	ГДЕ
	|		ТиповыеАнкетыВопросыАнкеты.Ссылка = &ТиповаяАнкета) КАК ВопросыАнкеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Опрос.Вопросы КАК ОпросВопросы
	|		ПО ВопросыАнкеты.Вопрос = ОпросВопросы.Вопрос
	|			И (ОпросВопросы.Ссылка = &ДокументОпрос)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВопросыАнкеты.НомерСтроки,
	|	ВопросыАнкеты.Вопрос,
	|	ОпросСоставнойОтвет.Ответ,
	|	ОпросСоставнойОтвет.ТиповойОтвет,
	|	ОпросСоставнойОтвет.НомерСтрокиВТаблице,
	|	ВопросыДляАнкетированияКолонкиТаблицы.КолонкаТаблицы,
	|	ВопросыАнкеты.ТипВопроса,
	|	ВопросыДляАнкетированияКолонкиТаблицы.НомерСтроки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТиповыеАнкетыВопросыАнкеты.Вопрос КАК Вопрос,
	|		ТиповыеАнкетыВопросыАнкеты.НомерСтроки КАК НомерСтроки,
	|		ТиповыеАнкетыВопросыАнкеты.Вопрос.ТипВопроса КАК ТипВопроса
	|	ИЗ
	|		Справочник.ТиповыеАнкеты.ВопросыАнкеты КАК ТиповыеАнкетыВопросыАнкеты
	|	ГДЕ
	|		ТиповыеАнкетыВопросыАнкеты.Ссылка = &ТиповаяАнкета) КАК ВопросыАнкеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Опрос.СоставнойОтвет КАК ОпросСоставнойОтвет
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ВопросыДляАнкетированияКолонкиТаблицы.КолонкаТаблицы КАК КолонкаТаблицы,
	|				ВопросыДляАнкетированияКолонкиТаблицы.НомерСтроки КАК НомерСтроки,
	|				ВопросыДляАнкетированияКолонкиТаблицы.Ссылка.КоличествоСтрокТаблицы КАК КоличествоСтрокТаблицы
	|			ИЗ
	|				ПланВидовХарактеристик.ВопросыДляАнкетирования.КолонкиТаблицы КАК ВопросыДляАнкетированияКолонкиТаблицы
	|			ГДЕ
	|				ВопросыДляАнкетированияКолонкиТаблицы.Ссылка В
	|						(ВЫБРАТЬ
	|							ТиповыеАнкетыВопросыАнкеты.Вопрос
	|						ИЗ
	|							Справочник.ТиповыеАнкеты.ВопросыАнкеты КАК ТиповыеАнкетыВопросыАнкеты
	|						ГДЕ
	|							ТиповыеАнкетыВопросыАнкеты.Ссылка = &ТиповаяАнкета)) КАК ВопросыДляАнкетированияКолонкиТаблицы
	|			ПО ОпросСоставнойОтвет.Вопрос = ВопросыДляАнкетированияКолонкиТаблицы.КолонкаТаблицы
	|		ПО ВопросыАнкеты.Вопрос = ОпросСоставнойОтвет.ВопросВладелец
	|			И (ОпросСоставнойОтвет.Ссылка = &ДокументОпрос)
	|ГДЕ
	|	(ВопросыДляАнкетированияКолонкиТаблицы.КоличествоСтрокТаблицы >= ОпросСоставнойОтвет.НомерСтрокиВТаблице
	|				И ОпросСоставнойОтвет.ВопросВладелец.ТипВопроса = &Табличный
	|			ИЛИ ОпросСоставнойОтвет.ВопросВладелец.ТипВопроса = &ВВидеНесколькихОтветов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	НомерСтрокиВТаблице,
	|	НомерСтрокиКолонки
	|ИТОГИ ПО
	|	Вопрос
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументОпрос", 			Ссылка);
	Запрос.УстановитьПараметр("ТиповаяАнкета", 			ТиповаяАнкета);
	Запрос.УстановитьПараметр("Табличный", 				Перечисления.ТипВопросаАнкеты.Табличный);
	Запрос.УстановитьПараметр("ВВидеНесколькихОтветов",	Перечисления.ТипВопросаАнкеты.СправочникСсылка_ВариантыОтветов_Несколько);
	РезультатЗапрос = Запрос.Выполнить();
	ВыборкаЗапроса					= РезультатЗапрос.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Вопросы.Очистить();
	СоставнойОтвет.Очистить();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Если ВыборкаЗапроса.Вопрос.ТипВопроса = Перечисления.ТипВопросаАнкеты.Табличный ИЛИ ВыборкаЗапроса.Вопрос.ТипВопроса = Перечисления.ТипВопросаАнкеты.СправочникСсылка_ВариантыОтветов_Несколько тогда
			//ТабличныйВопрос = ВыборкаЗапроса.Вопрос;
			НоваяСтрока 		= Вопросы.Добавить();
			НоваяСтрока.Вопрос 	= ВыборкаЗапроса.Вопрос;
			НоваяСтрока.ТиповойОтвет 	= ВыборкаЗапроса.ТиповойОтвет;
			НоваяСтрока.Ответ 			= ВыборкаЗапроса.Ответ;
			ВыборкаЗапросаТабличныйВопрос	= ВыборкаЗапроса.Выбрать();
			Пока ВыборкаЗапросаТабличныйВопрос.Следующий() Цикл
				Если НЕ ЗначениеЗаполнено(ВыборкаЗапросаТабличныйВопрос.КолонкаТаблицы) И (ВыборкаЗапросаТабличныйВопрос.ТипВопроса = Перечисления.ТипВопросаАнкеты.Табличный) тогда
					Продолжить;
				КонецЕСли;
				Если НЕ ЗначениеЗаполнено(ВыборкаЗапросаТабличныйВопрос.ТиповойОтвет) И (ВыборкаЗапросаТабличныйВопрос.Вопрос.ТипВопроса = Перечисления.ТипВопросаАнкеты.СправочникСсылка_ВариантыОтветов_Несколько) тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока 				= СоставнойОтвет.Добавить();
				Если ВыборкаЗапроса.Вопрос.ТипВопроса = Перечисления.ТипВопросаАнкеты.СправочникСсылка_ВариантыОтветов_Несколько тогда
					НоваяСтрока.Вопрос 			= ВыборкаЗапросаТабличныйВопрос.Вопрос;
				Иначе
					НоваяСтрока.Вопрос 			= ВыборкаЗапросаТабличныйВопрос.КолонкаТаблицы;
				КонецЕСли;
				НоваяСтрока.ВопросВладелец 	= ВыборкаЗапросаТабличныйВопрос.Вопрос;
				Если НЕ ЗначениеЗаполнено(ВыборкаЗапросаТабличныйВопрос.ТиповойОтвет) тогда
					НазначитьТипОтвета(НоваяСтрока);
				Иначе
					НоваяСтрока.ТиповойОтвет 	= ВыборкаЗапросаТабличныйВопрос.ТиповойОтвет;
				КонецЕсли;
				НоваяСтрока.Ответ 			= ВыборкаЗапросаТабличныйВопрос.Ответ;
				НоваяСтрока.НомерСтрокиВТаблице	= ВыборкаЗапросаТабличныйВопрос.НомерСтрокиВТаблице;
			КонецЦикла;
		Иначе
			НоваяСтрока 		= Вопросы.Добавить();
			НоваяСтрока.Вопрос 	= ВыборкаЗапроса.Вопрос;
			ВыборкаЗапросаОтвет	= ВыборкаЗапроса.Выбрать();
			Пока ВыборкаЗапросаОтвет.Следующий() Цикл
				Если НЕ ЗначениеЗаполнено(ВыборкаЗапросаОтвет.ТиповойОтвет) тогда
					НазначитьТипОтвета(НоваяСтрока);
					Продолжить;
				КонецЕсли;
				НоваяСтрока.ТиповойОтвет 	= ВыборкаЗапросаОтвет.ТиповойОтвет;
				НоваяСтрока.Ответ 			= ВыборкаЗапросаОтвет.Ответ;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПередОткрытием" формы.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	// Установка кнопок заполнение ТЧ
	УстановитьКнопкиПодменюЗаполненияТЧ();
	
КонецПроцедуры // ПередОткрытием()

// Процедура - обработчик события "ПриОткрытии" формы
//
Процедура ПриОткрытии()
	
	Если ЭтоНовый() Тогда // проверить объект на то, что он еще не внесен в ИБ
		
		// Заполнить реквизиты значениями по умолчанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	Иначе 
		// Установить доступность формы с учетом даты запрета редактирования	
		РаботаСДиалогами.УстановитьДоступностьФормыДляРедактирования(ЭтотОбъект, ЭтаФорма);
	КонецЕсли;
	
	// Вывести в заголовке формы статус документа (новый, не проведен, проведен).
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, ЭтотОбъект, ЭтаФорма);
	
	// Запомнить текущие значения реквизитов формы.
	мТекущаяДатаДокумента = Дата;
	мСтараяТиповаяАнкета = ТиповаяАнкета;
	ТаблицаВопросовОтветовПоАнкете = ЗапросПоАнкете(ТиповаяАнкета);
	
	ПроверкаДоступностиТаблицВопросовИОтветов();
	
	// Установить активный реквизит.
	РаботаСДиалогами.АктивизироватьРеквизитВФорме(ЭтотОбъект, ЭтаФорма);
	
	МеханизмНумерацииОбъектов.ДобавитьВМенюДействияКнопкуРедактированияНомера(ЭлементыФормы.ДействияФормы.Кнопки.Подменю);
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю,ЭлементыФормы.Номер);
	
	// Создать кнопки печати
	ФормированиеПечатныхФорм.СоздатьКнопкиПечати(ЭтотОбъект, ЭтаФорма);
	
КонецПроцедуры // ПриОткрытии()

// Процедура - обработчик события "ПослеЗаписи" формы.
//
Процедура ПослеЗаписи()

	// Вывести в заголовке формы статус документа (новый, не проведен, проведен).
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, ЭтотОбъект, ЭтаФорма);
	МеханизмНумерацииОбъектов.ОбновитьПодсказкуКодНомерОбъекта(ЭтотОбъект.Метаданные(), ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Номер);
	ПроверитьОбязательноЗаполняемыеОтветы();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

Процедура ДействияФормыРедактироватьНомер(Кнопка)
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(ЭтотОбъект.Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Номер);
КонецПроцедуры
// Процедура вызывается при выборе пункта подменю "Движения документа по регистрам" меню "Перейти".
// командной панели формы. Процедура отрабатывает печать движений документа по регистрам.
//
Процедура ДействияФормыДвиженияДокументаПоРегистрам(Кнопка)

	РаботаСДиалогами.НапечататьДвиженияДокумента(Ссылка);

КонецПроцедуры // ДействияФормыДвиженияДокументаПоРегистрам()

Процедура КоманднаяПанельВопросыИОтветыОбновить(Кнопка)
	
	ОбновитьСписокВопросов();
	
КонецПроцедуры

Процедура ОсновныеДействияФормыЗаполнить(Кнопка)
	
	ФормаРедактированияОтвета = ПолучитьФорму("ФормаВводаОтветовТеста");
	ФормаРедактированияОтвета.ОткрытьМодально();
	
	ВопросыИОтветыПриАктивизацииСтроки(ЭлементыФормы.ВопросыИОтветы);
	
КонецПроцедуры

// Процедура - обработчик нажатия на кнопку "Печать".
// Открывает форму выбора печатных форм объекта.
//
Процедура ОсновныеДействияФормыПечать(Кнопка)
	
	УниверсальныеМеханизмы.ОткрытьФормуВыбораПечатныхФормОбъекта(ЭтотОбъект, ЭтаФорма);
	
КонецПроцедуры // ОсновныеДействияФормыПечать() 

// Процедура - обработчик нажатия на кнопку "Печать по умолчанию"
//
Процедура ОсновныеДействияФормыПечатьПоУмолчанию(Кнопка)

	УниверсальныеМеханизмы.НапечататьДокументПоУмолчанию(ЭтотОбъект);

КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТКИ СВОЙСТВ И КАТЕГОРИЙ

// Процедура выполняет открытие формы работы со свойствами документа
//
Процедура ДействияФормыДействиеОткрытьСвойства(Кнопка)

	РаботаСДиалогами.ОткрытьСвойстваДокумента(ЭтотОбъект, ЭтаФорма);

КонецПроцедуры

// Процедура выполняет открытие формы работы с категориями документа
//
Процедура ДействияФормыДействиеОткрытьКатегории(Кнопка)

	РаботаСДиалогами.ОткрытьКатегорииДокумента(ЭтотОбъект, ЭтаФорма);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

// Процедура - обработчик события "ПриИзменении" поля ввода даты документа
//
Процедура ДатаПриИзменении(Элемент = Неопределено)
	
	РаботаСДиалогами.ПроверитьНомерДокумента(ДокументОбъект, мТекущаяДатаДокумента);
	МеханизмНумерацииОбъектов.ОбновитьПодсказкуКодНомерОбъекта(ЭтотОбъект.Метаданные(), ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Номер);
	
	мТекущаяДатаДокумента = Дата;
	
КонецПроцедуры // ДатаПриИзменении

//  Процедура заполняет список вопросов по выбранной пользователем "Типовой анкете"
//
// Параметры:
//  Элемент      - элемент формы, который отображает типовую анкету.
//
Процедура ТиповаяАнкетаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ТиповаяАнкета) тогда
		Если Вопросы.Количество() > 0 тогда
			Если Вопрос(НСтр("ru='Список вопросов и ответов будет очищен и заполнен новыми данными! Продолжить?';uk='Список питань і відповідей буде очищений і заповнений новими даними! Продовжити?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, ) = КодВозвратаДиалога.Да тогда
				Вопросы.Очистить();
				СоставнойОтвет.Очистить();
			Иначе
				ТиповаяАнкета = мСтараяТиповаяАнкета;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		ЗаполнитьВопросыАнкеты(Элемент.Значение);
		ТаблицаВопросовОтветовПоАнкете = ЗапросПоАнкете(Элемент.Значение);
	КонецЕсли;
	мСтараяТиповаяАнкета = ТиповаяАнкета;
	
КонецПроцедуры

Процедура ОпрашиваемоеЛицоПриИзменении(Элемент)
	
	ПроверкаДоступностиТаблицВопросовИОтветов();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ ВопросыИОтветы

// Процедура - обработчик события "ПередНачаломИзменения" табличного поля.
Процедура ВопросыИОтветыПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущаяКолонка.Имя = "ТиповойОтвет" Тогда
		ПодоготовитьПолучениеОтвета(Элемент.ТекущаяСтрока, Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриВыводеСтроки" табличного поля.
// сделаем поле развернутого ответа доступным тогда, когда это требует типовой ответ
//
// Параметры:
//  Элемент      - табличное поле, которое отображает т.ч.
//  
Процедура ВопросыИОтветыПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	//Если ЭлементыФормы.ВопросыИОтветы.ТекущиеДанные <> Неопределено тогда
		Если Элемент.Колонки.ТиповойОтвет.Видимость тогда
			Если ДанныеСтроки.Вопрос.ТипВидКонтакнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес тогда
				
				МассивПолей = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ДанныеСтроки.ТиповойОтвет, "¤");
				Если МассивПолей.Количество() > 1 тогда
					Регион  = МассивПолей[1];
				КонецЕсли;
				Если МассивПолей.Количество() > 2 тогда
					Район   = МассивПолей[2];
				КонецЕсли;
				Если МассивПолей.Количество() > 3 тогда
					Город   = МассивПолей[3];
				КонецЕсли;
				Если МассивПолей.Количество() > 4 тогда
					НаселенныйПункт = МассивПолей[4];
				КонецЕсли;
				Если МассивПолей.Количество() > 5 тогда
					Улица   = МассивПолей[5];
				КонецЕсли;
				Если МассивПолей.Количество() > 6 тогда
					Дом     = МассивПолей[6];
				КонецЕсли;
				Если МассивПолей.Количество() > 7 тогда
					Корпус  = МассивПолей[7];
				КонецЕсли;
				Если МассивПолей.Количество() > 8 тогда
					Квартира= МассивПолей[8];
				КонецЕсли;
				Если МассивПолей.Количество() > 0 тогда
					Индекс  = МассивПолей[0];
				КонецЕсли;
				Если МассивПолей.Количество() > 9 тогда
					КомментарийАдреса  = МассивПолей[9];
				КонецЕсли;
				
				Представление = "";
				Если СокрЛП(Индекс) <> "" Тогда
					Представление = Представление + ", " + СокрЛП(Индекс);
				КонецЕсли;
				Если СокрЛП(Регион) <> "" Тогда
					Представление = Представление + ", " + СокрЛП(Регион);
				КонецЕсли;
				Если СокрЛП(Район) <> "" Тогда
					Представление = Представление + ", " + СокрЛП(Район);
				КонецЕсли;
				Если СокрЛП(Город) <> "" Тогда
					Представление = Представление + ", " + СокрЛП(Город);
				КонецЕсли;
				Если СокрЛП(НаселенныйПункт) <> "" Тогда
					Представление = Представление + ", " + СокрЛП(НаселенныйПункт);
				КонецЕсли;
				Если СокрЛП(Улица) <> "" Тогда
					Представление = Представление + ", " + СокрЛП(Улица);
				КонецЕсли;
				Если СокрЛП(Дом) <> "" Тогда
					Представление = Представление + НСтр("ru=', д. ';uk=', б. '") + СокрЛП(Дом);
				КонецЕсли;
				Если СокрЛП(Корпус) <> "" Тогда
					Представление = Представление + НСтр("ru=', корп. ';uk=', корп. '") + СокрЛП(Корпус);
				КонецЕсли;
				Если СокрЛП(Квартира) <> "" Тогда
					Представление = Представление + НСтр("ru=', кв. ';uk=', кв. '") + СокрЛП(Квартира);
				КонецЕсли;
				Если СокрЛП(КомментарийАдреса) <> "" Тогда
					Представление = Представление + ", " + СокрЛП(КомментарийАдреса);
				КонецЕсли;
							
				Если СтрДлина(Представление) > 2 Тогда
					Представление = Сред(Представление, 3);
				КонецЕсли;
				ОформлениеСтроки.Ячейки.ТиповойОтвет.Текст = Представление;
				
				//ОформлениеСтроки.Ячейки.ТиповойОтвет.Текст = СтрЗаменить(ОформлениеСтроки.Ячейки.ТиповойОтвет.Текст, "¤", ", ");
			ИначеЕсли ДанныеСтроки.Вопрос.ТипВидКонтакнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон тогда
				МассивПолей = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ДанныеСтроки.ТиповойОтвет, "¤");
				Если МассивПолей.Количество() > 0 тогда
					Поле1 = МассивПолей[0];
				КонецЕсли;
				Если МассивПолей.Количество() > 1 тогда
					Поле2 = МассивПолей[1];
				КонецЕсли;
				Если МассивПолей.Количество() > 2 тогда
					Поле3 = МассивПолей[2];
				КонецЕсли;
				Если МассивПолей.Количество() > 3 тогда
					Поле4 = МассивПолей[3];
				КонецЕсли;
				Если МассивПолей.Количество() > 4 тогда
					Коммент = МассивПолей[4];
				КонецЕсли;
				Предст = ""+?(Не ПустаяСтрока(Поле1),("+"+Поле1),"");
				Предст = Предст + ?((Не ПустаяСтрока(Поле2)),(ПроверкаПустойСтроки(Предст,Ложь)+"(" + Поле2 + ")"),"");
				Предст = Предст + ?((Не ПустаяСтрока(Поле3)),(ПроверкаПустойСтроки(Предст,ПустаяСтрока(Поле2))+Поле3),"");
				Предст = Предст + ?((Не ПустаяСтрока(Поле4)),(ПроверкаПустойСтроки(Предст)+НСтр("ru='доб. ';uk='дод. '") + Поле4),"");
				Предст = Предст + ?((Не ПустаяСтрока(Коммент)),(ПроверкаПустойСтроки(Предст)+" " + Коммент),"");
				ОформлениеСтроки.Ячейки.ТиповойОтвет.Текст = Предст;
			Иначе
				ОформлениеСтроки.Ячейки.ТиповойОтвет.Текст = ""+Формат(ДанныеСтроки.ТиповойОтвет, "ДФ=dd.MM.yyyy; ДП=; БЛ=Нет; БИ=Да")+ " " + ДанныеСтроки.Ответ;
			КонецЕсли;
		КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ВопросыИОтветыПриАктивизацииСтроки(Элемент)
	
	ТаблицаСоставногоОтвета.Очистить();
	Если Элемент.ТекущиеДанные = Неопределено тогда
		Возврат;
	КонецЕсли;
	Если Элемент.ТекущиеДанные.Вопрос.ТипВопроса = Перечисления.ТипВопросаАнкеты.Табличный тогда
		ЭлементыФормы.ТабличноеПолеСоставногоОтвета.ИзменятьПорядокСтрок 	= Ложь;
		ЭлементыФормы.ТабличноеПолеСоставногоОтвета.ИзменятьСоставСтрок 	= Ложь;
		
		ТаблицаСоставногоОтвета = Новый ТаблицаЗначений;
		
		ТаблицаСоставногоОтвета.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"), "№");
		КолонкиТабличногоВопроса = Элемент.ТекущиеДанные.Вопрос.КолонкиТаблицы;
		Для каждого КолонкаТВ из КолонкиТабличногоВопроса Цикл
			ТаблицаСоставногоОтвета.Колонки.Добавить("колонка"+КолонкаТВ.НомерСтроки, КолонкаТВ.КолонкаТаблицы.ТипЗначения, КолонкаТВ.КолонкаТаблицы.Наименование);
		КонецЦикла;
		ЭлементыФормы.ТабличноеПолеСоставногоОтвета.СоздатьКолонки();
		ПараметрыПоиска = Новый Структура("ВопросВладелец");
		ПараметрыПоиска.ВопросВладелец = Элемент.ТекущиеДанные.Вопрос;
		МассивСтрок = СоставнойОтвет.НайтиСтроки(ПараметрыПоиска);
		СписокНомеровСтрок = Новый СписокЗначений;
		Для каждого ИндексНомераСтроки из МассивСтрок Цикл
			Если СписокНомеровСтрок.НайтиПоЗначению(ИндексНомераСтроки.НомерСтрокиВТаблице) = Неопределено тогда
				СписокНомеровСтрок.Добавить(ИндексНомераСтроки.НомерСтрокиВТаблице);
			КонецЕсли;
		КонецЦикла;
		
		ВсегоСтрок = 0;
		//Если СписокНомеровСтрок.Количество() > 0 тогда
		//	ВсегоСтрок = СписокНомеровСтрок[СписокНомеровСтрок.Количество()-1].Значение;
		//КонецЕсли;
		ВсегоСтрок = Элемент.ТекущиеДанные.Вопрос.КоличествоСтрокТаблицы;
		
		Для ИндексНомераСтроки = 1 по ВсегоСтрок Цикл
			ПараметрыПоиска = Новый Структура("ВопросВладелец, НомерСтрокиВТаблице");
			ПараметрыПоиска.ВопросВладелец = Элемент.ТекущиеДанные.Вопрос;
			ПараметрыПоиска.НомерСтрокиВТаблице = ИндексНомераСтроки;
			ОтветНаТабличныйВопрос = СоставнойОтвет.НайтиСтроки(ПараметрыПоиска);
			СтрокаОтвет = ТаблицаСоставногоОтвета.Добавить();
			СтрокаОтвет.НомерСтроки = ИндексНомераСтроки;
			НомерКолонки = 1; // пропустим номер строки
			Для каждого КолонкаОтвет из ОтветНаТабличныйВопрос Цикл
				СтрокаОтвет[НомерКолонки] = КолонкаОтвет.ТиповойОтвет;
				НомерКолонки = НомерКолонки + 1;
				Если НомерКолонки >= ТаблицаСоставногоОтвета.Колонки.Количество() тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	ИначеЕсли Элемент.ТекущиеДанные.Вопрос.ТипВопроса = Перечисления.ТипВопросаАнкеты.СправочникСсылка_ВариантыОтветов_Несколько тогда
		ЭлементыФормы.ТабличноеПолеСоставногоОтвета.ИзменятьПорядокСтрок 	= Истина;
		ЭлементыФормы.ТабличноеПолеСоставногоОтвета.ИзменятьСоставСтрок 	= Истина;
		
		ТаблицаСоставногоОтвета = Новый ТаблицаЗначений;
		
		ТаблицаСоставногоОтвета.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"), "№");
		КолонкиТабличногоВопроса = Элемент.ТекущиеДанные.Вопрос.КолонкиТаблицы;
		ТаблицаСоставногоОтвета.Колонки.Добавить("ВариантОтвета", Элемент.ТекущиеДанные.Вопрос.ТипЗначения, НСтр("ru='Составной ответ';uk='Складова відповідь'"));
		ТаблицаСоставногоОтвета.Колонки.Добавить("Ответ", Новый ОписаниеТипов("Строка"), НСтр("ru='Развернутый ответ';uk='Розгорнута відповідь'"));
		ЭлементыФормы.ТабличноеПолеСоставногоОтвета.СоздатьКолонки();
		ЭлементыФормы.ТабличноеПолеСоставногоОтвета.Колонки.ВариантОтвета.ЭлементУправления.ВыборПоВладельцу = Элемент.ТекущиеДанные.Вопрос;
		ПараметрыПоиска 				= Новый Структура("ВопросВладелец");
		ПараметрыПоиска.ВопросВладелец 	= Элемент.ТекущиеДанные.Вопрос;
		МассивСтрок 					= СоставнойОтвет.НайтиСтроки(ПараметрыПоиска);
		Для каждого ИндексНомераСтроки из МассивСтрок Цикл
			СтрокаОтвет 			 	= ТаблицаСоставногоОтвета.Добавить();
			СтрокаОтвет.НомерСтроки 	= ИндексНомераСтроки.НомерСтрокиВТаблице;
			СтрокаОтвет.ВариантОтвета	= ИндексНомераСтроки.ТиповойОтвет;
			СтрокаОтвет.Ответ			= ИндексНомераСтроки.Ответ;
		КонецЦикла;
	Иначе	
		ЭлементыФормы.ТабличноеПолеСоставногоОтвета.ИзменятьПорядокСтрок 	= Ложь;
		ЭлементыФормы.ТабличноеПолеСоставногоОтвета.ИзменятьСоставСтрок 	= Ложь;
		ЭлементыФормы.ТабличноеПолеСоставногоОтвета.Колонки.Очистить();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТАБЛИЧНОГО ПОЛЯ ВопросыИОтветы

// Процедура - обработчик события "Очистка" поля ввода "Вопрос".
Процедура ВопросыИОтветыВопросОчистка(Элемент, СтандартнаяОбработка)
	ЭлементыФормы.ВопросыИОтветы.ТекущиеДанные.ТиповойОтвет = Справочники.ВариантыОтветовОпросов.ПустаяСсылка();
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "ТиповойОтвет".
// если типовой ответ не требует дополнительных пояснений - очистим развернутый ответ
Процедура ВопросыИОтветыТиповойОтветПриИзменении(Элемент)
	
	Если Не ЭлементыФормы.ВопросыИОтветы.ТекущиеДанные.Вопрос.Предопределенный тогда
		Если ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.ВариантыОтветовОпросов") тогда
			Если Не Элемент.Значение.ТребуетРазвернутыйОтвет Тогда
				ЭлементыФормы.ВопросыИОтветы.ТекущиеДанные.Ответ = ""
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВопросыИОтветыТиповойОтветОчистка(Элемент, СтандартнаяОбработка)
	
	ЭлементыФормы.ВопросыИОтветы.ТекущиеДанные.ТиповойОтвет = ОбщегоНазначения.ПустоеЗначениеТипа(ЭлементыФормы.ВопросыИОтветы.ТекущиеДанные.Вопрос.ТипЗначения.Типы()[0]);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ ТабличноеПолеСоставногоОтвета

Процедура ТабличноеПолеСоставногоОтветаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	АктуализироватьТЧСоставногоОтвета(Элемент, Отказ);
	Если Элемент.ТекущиеДанные <> Неопределено тогда
		Если ЭлементыФормы.ВопросыИОтветы.ТекущиеДанные.Вопрос.ТипВопроса = Перечисления.ТипВопросаАнкеты.СправочникСсылка_ВариантыОтветов_Несколько Тогда
			Если НЕ Элемент.ТекущиеДанные.ВариантОтвета.ТребуетРазвернутыйОтвет тогда
				Элемент.ТекущиеДанные.Ответ = "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ТабличноеПолеСоставногоОтветаПриНачалеРедактирования(Элемент, НоваяСтрока)
	
	Если НоваяСтрока тогда
		Попытка
			Элемент.ТекущиеДанные.НомерСтроки = Элемент.Значение[ТаблицаСоставногоОтвета.Количество()-2].НомерСтроки+1;
		Исключение
			Элемент.ТекущиеДанные.НомерСтроки = 1;
		КонецПопытки;
	КонецЕсли;
	Попытка
		Элемент.Колонки.Ответ.ЭлементУправления.Доступность = Элемент.ТекущиеДанные.ВариантОтвета.ТребуетРазвернутыйОтвет;
		//будет срабатывать только для составных вопросов
	Исключение
	КонецПопытки
	
КонецПроцедуры

Процедура ТабличноеПолеСоставногоОтветаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущаяСтрока = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Если Элемент.ТекущаяСтрока.ВариантОтвета.Владелец.ТипВопроса = Перечисления.ТипВопросаАнкеты.СправочникСсылка_ВариантыОтветов_Несколько тогда
			Элемент.Колонки.Ответ.ЭлементУправления.Доступность = Элемент.ТекущаяСтрока.ВариантОтвета.ТребуетРазвернутыйОтвет;
			//будет срабатывать только для составных вопросов
		КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура ТабличноеПолеСоставногоОтветаПриАктивизацииКолонки(Элемент)
	
	Если Элемент.ТекущаяСтрока = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Если Элемент.ТекущаяСтрока.ВариантОтвета.Владелец.ТипВопроса = Перечисления.ТипВопросаАнкеты.СправочникСсылка_ВариантыОтветов_Несколько тогда
			Элемент.Колонки.Ответ.ЭлементУправления.Доступность = Элемент.ТекущаяСтрока.ВариантОтвета.ТребуетРазвернутыйОтвет;
			//будет срабатывать только для составных вопросов
		КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура ТабличноеПолеСоставногоОтветаПослеУдаления(Элемент)
	
	АктуализироватьТЧСоставногоОтвета(Элемент, Ложь);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
